import "./footer.scss";
import footerLogo from "..//..//assets/img/footerLogo-icon.svg";
import { NavLink } from "react-router-dom";
import instagramIcon from "..//..//assets/img/instagram-icon.png";
import vkIcon from "..//..//assets/img/vk-icon.png";
import visaCardIcon from "..//..//assets/img/visa-card-icon.svg";
import masterCardIcon from "..//..//assets/img/mastercard-logo-icon.svg";
import facebookIcon from "..//..//assets/img/facebook-icon.png";
import { useState } from "react";

function Footer() {
  const [, setScroll] = useState(0);

  function handleScrollUp() {
    setScroll(() => {
      window.scrollTo(0, 0);
    });
  }

  return (
    <footer className="footer">
      <div className="footer__inner-block">
        <div className="footer__logo-block">
          <NavLink to="/">
            <img className="footer__logo" src={footerLogo} alt="" />
          </NavLink>

          <ul className="footer__cards">
            <li className="footer__card">
              <a href="/">
                <img src={visaCardIcon} alt="" />
              </a>
            </li>
            <li className="footer__card">
              <a href="/">
                <img src={masterCardIcon} alt="" />
              </a>
            </li>
          </ul>
          <p>&copy;Все права защищены</p>
        </div>
        <div className="footer__links-block">
          <div className="footer__block-link">
            <ul className="footer__link">
              <li>
                <NavLink to="/designer">Конструктор подарка</NavLink>
              </li>
              <li>
                <NavLink to="/questionAndAnswer">Вопрос - ответ</NavLink>
              </li>
              <li>
                <NavLink to="/articles">Статьи</NavLink>
              </li>
            </ul>
          </div>
          <div className="footer__block-link">
            <ul className="footer__link">
              <li>
                <NavLink to="/delivery">Доставка</NavLink>
              </li>
              <li>
                <NavLink to="/payment">Оплата</NavLink>
              </li>
              <li>
                <NavLink to="/about">О нас</NavLink>
              </li>
              <li>
                <NavLink to="/brands">Бренды</NavLink>
              </li>
            </ul>
          </div>
          <div className="footer__block-link">
            <ul className="footer__link">
              <li>
                <NavLink to="/guarantee">Гарантии и возврат</NavLink>
              </li>
              <li>
                <NavLink to="/contact">Контакты</NavLink>
              </li>
              <li>
                <NavLink to="/help">Помощь</NavLink>
              </li>
            </ul>
          </div>
        </div>
        <div className="footer__interface-block">
          <ul className="footer__user-interface">
            <li className="footer__user-profile">
              <NavLink to="/profile">
                <svg
                  width="25"
                  height="25"
                  viewBox="0 0 25 25"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clip-path="url(#clip0_5173_1871)">
                    <path
                      id="img-id"
                      d="M12.5 12.5322C5.91182 12.5322 0.551743 17.8923 0.551743 24.4805C0.551743 24.7672 0.784491 25 1.07125 25C1.35801 25 1.59076 24.7672 1.59076 24.4805C1.59076 18.4648 6.48436 13.5711 12.5001 13.5711C18.5158 13.5711 23.4094 18.4648 23.4094 24.4805C23.4094 24.7672 23.6421 25 23.9289 25C24.2156 25 24.4484 24.7672 24.4484 24.4805C24.4483 17.8912 19.0882 12.5322 12.5 12.5322Z"
                      fill="black"
                    />
                    <path
                      id="img-id"
                      d="M12.4999 0C9.34971 0 6.78554 2.56315 6.78554 5.71439C6.78554 8.86562 9.34976 11.4288 12.4999 11.4288C15.6501 11.4288 18.2143 8.86562 18.2143 5.71439C18.2143 2.56315 15.6501 0 12.4999 0ZM12.4999 10.3898C9.92221 10.3898 7.8245 8.2921 7.8245 5.71439C7.8245 3.13667 9.92221 1.03897 12.4999 1.03897C15.0776 1.03897 17.1753 3.13667 17.1753 5.71439C17.1753 8.2921 15.0776 10.3898 12.4999 10.3898Z"
                      fill="black"
                    />
                  </g>
                  <defs>
                    <clipPath id="clip0_5173_1871">
                      <rect width="25" height="25" fill="white" />
                    </clipPath>
                  </defs>
                </svg>
              </NavLink>
            </li>
            <li className="footer__user-favourites-products">
              <NavLink to="/favoritesProducts">
                <svg
                  width="25"
                  height="25"
                  viewBox="0 0 25 25"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clip-path="url(#clip0_5173_1895)">
                    <path
                      id="img-id"
                      d="M24.4573 11.3792C24.9494 10.8996 25.1231 10.1957 24.9109 9.54145C24.6981 8.88717 24.1439 8.42011 23.4631 8.32099L17.4099 7.44143C17.152 7.40389 16.9293 7.24219 16.8141 7.00841L14.1079 1.52333C13.804 0.907091 13.1873 0.524132 12.5 0.524132C11.8131 0.524132 11.1964 0.907091 10.8925 1.52333L8.18578 7.00841C8.07064 7.24219 7.84737 7.40389 7.58957 7.44143L1.5363 8.32149C0.855985 8.42011 0.301819 8.88717 0.0890641 9.54145C-0.123191 10.1957 0.0505178 10.8996 0.542608 11.3792L4.92236 15.6483C5.10909 15.8305 5.19469 16.0928 5.15064 16.3491L4.1169 22.3779C4.00076 23.0552 4.27359 23.7265 4.82975 24.131C5.38542 24.5359 6.10879 24.5885 6.71802 24.2676L12.1315 21.4212C12.3623 21.3001 12.6376 21.3001 12.8684 21.4212L18.2824 24.2676C18.5467 24.4068 18.8331 24.4754 19.1179 24.4754C19.4878 24.4754 19.8563 24.3597 20.1707 24.131C20.7268 23.7265 20.9997 23.0552 20.8835 22.3779L19.8493 16.3496C19.8052 16.0928 19.8908 15.831 20.0776 15.6488L24.4573 11.3792ZM18.8631 16.5188L19.8968 22.5471C19.9489 22.8504 19.8313 23.1403 19.582 23.3215C19.3322 23.5022 19.0213 23.5242 18.7485 23.3821L13.3345 20.5351C13.0736 20.3985 12.7863 20.3294 12.5 20.3294C12.2136 20.3294 11.9268 20.3985 11.6655 20.5356L6.25246 23.3821C5.97863 23.5242 5.66776 23.5022 5.41846 23.3215C5.16916 23.1403 5.05202 22.8509 5.10358 22.5471L6.13732 16.5188C6.23694 15.9371 6.04421 15.3434 5.6217 14.9319L1.24145 10.6623C1.02068 10.447 0.945592 10.1437 1.04121 9.85082C1.13632 9.55747 1.37511 9.35623 1.67997 9.31168L7.73274 8.43212C8.31694 8.34752 8.82204 7.98108 9.08286 7.45145L11.7896 1.96636C11.9258 1.69003 12.1916 1.52533 12.4995 1.52533C12.8078 1.52533 13.0731 1.69003 13.2098 1.96636L15.9166 7.45145C16.1774 7.98108 16.682 8.34752 17.2662 8.43212L23.3194 9.31168C23.6243 9.35623 23.8631 9.55747 23.9582 9.85082C24.0533 10.1437 23.9787 10.447 23.758 10.6623L19.3782 14.9314C18.9557 15.3434 18.763 15.9366 18.8631 16.5188Z"
                      fill="black"
                    />
                  </g>
                  <defs>
                    <clipPath id="clip0_5173_1895">
                      <rect width="25" height="25" fill="white" />
                    </clipPath>
                  </defs>
                </svg>
              </NavLink>
            </li>
            <li className="footer__user-like">
              <NavLink to="/likes">
                <svg
                  width="25"
                  height="23"
                  viewBox="0 0 25 23"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    id="img-id"
                    d="M12.5 22.6092C12.1441 22.6092 11.8009 22.4802 11.5335 22.246C10.5236 21.3629 9.54989 20.533 8.69082 19.801L8.68643 19.7972C6.16778 17.6508 3.99284 15.7973 2.47955 13.9714C0.787924 11.9301 0 9.99472 0 7.88042C0 5.82621 0.704382 3.93107 1.98326 2.54385C3.27739 1.14024 5.05313 0.367188 6.98393 0.367188C8.42703 0.367188 9.74863 0.823425 10.9119 1.72312C11.499 2.17726 12.0312 2.73306 12.5 3.38137C12.969 2.73306 13.501 2.17726 14.0882 1.72312C15.2515 0.823425 16.5731 0.367188 18.0162 0.367188C19.9468 0.367188 21.7228 1.14024 23.0169 2.54385C24.2958 3.93107 25 5.82621 25 7.88042C25 9.99472 24.2122 11.9301 22.5206 13.9712C21.0073 15.7973 18.8326 17.6506 16.3143 19.7968C15.4537 20.53 14.4785 21.3612 13.4662 22.2464C13.199 22.4802 12.8557 22.6092 12.5 22.6092ZM6.98393 1.83165C5.46702 1.83165 4.07352 2.43704 3.05976 3.53644C2.03094 4.65243 1.46427 6.19509 1.46427 7.88042C1.46427 9.65865 2.12516 11.249 3.60698 13.0369C5.03921 14.7652 7.16952 16.5806 9.6361 18.6827L9.64068 18.6865C10.503 19.4214 11.4805 20.2545 12.4979 21.1441C13.5214 20.2528 14.5004 19.4184 15.3644 18.6823C17.8308 16.5802 19.9609 14.7652 21.3932 13.0369C22.8748 11.249 23.5357 9.65865 23.5357 7.88042C23.5357 6.19509 22.969 4.65243 21.9402 3.53644C20.9266 2.43704 19.5329 1.83165 18.0162 1.83165C16.905 1.83165 15.8848 2.18489 14.9839 2.88145C14.1811 3.50249 13.6219 4.28755 13.294 4.83687C13.1254 5.11935 12.8286 5.28796 12.5 5.28796C12.1713 5.28796 11.8746 5.11935 11.7059 4.83687C11.3783 4.28755 10.819 3.50249 10.016 2.88145C9.1152 2.18489 8.09496 1.83165 6.98393 1.83165Z"
                    fill="#454545"
                  />
                </svg>
              </NavLink>
            </li>
            <li className="footer__user-basket">
              <NavLink to="/basket  ">
                <svg
                  width="25"
                  height="25"
                  viewBox="0 0 25 25"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    id="img-id"
                    d="M8.05473 16.1623H8.05588C8.05683 16.1623 8.05779 16.1621 8.05874 16.1621H21.3379C21.6648 16.1621 21.9522 15.9452 22.0421 15.6309L24.9718 5.37701C25.0349 5.15594 24.9907 4.91829 24.8524 4.7348C24.7139 4.55132 24.4974 4.44336 24.2676 4.44336H6.36559L5.84202 2.08721C5.76744 1.75209 5.47028 1.51367 5.12695 1.51367H0.732422C0.327873 1.51367 0 1.84155 0 2.24609C0 2.65064 0.327873 2.97852 0.732422 2.97852H4.53949C4.63219 3.39603 7.04498 14.2538 7.18384 14.8785C6.40545 15.2168 5.85938 15.9929 5.85938 16.8945C5.85938 18.1061 6.84509 19.0918 8.05664 19.0918H21.3379C21.7424 19.0918 22.0703 18.7639 22.0703 18.3594C22.0703 17.9548 21.7424 17.627 21.3379 17.627H8.05664C7.65285 17.627 7.32422 17.2983 7.32422 16.8945C7.32422 16.4913 7.65171 16.1633 8.05473 16.1623ZM23.2965 5.9082L20.7853 14.6973H8.6441L6.69098 5.9082H23.2965Z"
                    fill="#454545"
                  />
                  <path
                    id="img-id"
                    d="M7.32422 21.2891C7.32422 22.5006 8.30994 23.4863 9.52148 23.4863C10.733 23.4863 11.7188 22.5006 11.7188 21.2891C11.7188 20.0775 10.733 19.0918 9.52148 19.0918C8.30994 19.0918 7.32422 20.0775 7.32422 21.2891ZM9.52148 20.5566C9.92527 20.5566 10.2539 20.8853 10.2539 21.2891C10.2539 21.6928 9.92527 22.0215 9.52148 22.0215C9.1177 22.0215 8.78906 21.6928 8.78906 21.2891C8.78906 20.8853 9.1177 20.5566 9.52148 20.5566Z"
                    fill="#454545"
                  />
                  <path
                    id="img-id"
                    d="M17.6758 21.2891C17.6758 22.5006 18.6615 23.4863 19.873 23.4863C21.0846 23.4863 22.0703 22.5006 22.0703 21.2891C22.0703 20.0775 21.0846 19.0918 19.873 19.0918C18.6615 19.0918 17.6758 20.0775 17.6758 21.2891ZM19.873 20.5566C20.2768 20.5566 20.6055 20.8853 20.6055 21.2891C20.6055 21.6928 20.2768 22.0215 19.873 22.0215C19.4693 22.0215 19.1406 21.6928 19.1406 21.2891C19.1406 20.8853 19.4693 20.5566 19.873 20.5566Z"
                    fill="#454545"
                  />
                </svg>
              </NavLink>
            </li>
          </ul>
          <ul className="footer__email-phone">
            <li className="footer__phone">
              <NavLink to="/phone">+74957556983</NavLink>
            </li>
            <li className="footer__email">
              <NavLink to="/user">nonamemag@gmail.com</NavLink>
            </li>
          </ul>
          <ul className="footer__socialNetworks">
            <li className="footer__instagram footer__socialNetworks-block">
              <a href="https://www.instagram.com/kabataev_/">
                <img src={instagramIcon} alt="instagram" />
              </a>
            </li>
            <li className="footer__facebook footer__socialNetworks-block">
              <a href="https://www.facebook.com/profile.php?id=100024984741599">
                <img src={facebookIcon} alt="facebook" />
              </a>
            </li>
            <li className="footer__vk footer__socialNetworks-block">
              <a href="https://vk.com/kabataevvv">
                <img src={vkIcon} alt="vk" />
              </a>
            </li>
          </ul>
        </div>
      </div>
      <p onClick={handleScrollUp} className="footer__btn-up">
        {" "}
        Вверх
      </p>
    </footer>
  );
}

export default Footer;
